app/views/users/process.html.erb

<h1>   billing_information</h1>
<% current_user.billing_information.attributes.each do |key, val| %>
---
SELECT `billing_informations`.* FROM `billing_informations` WHERE `billing_informations`.`user_id` = 1 LIMIT 1

<h1>shipping_information</h1>
<% current_user.shipping_information.attributes.each do |key, val| %>
---
SELECT `shipping_informations`.* FROM `shipping_informations` WHERE `shipping_informations`.`user_id` = 1 LIMIT 1