app/views/users/profile.html.erb

    <div class="indent">
      <%  if @billing_information.same_as_shipping_information.present? %>
---
SELECT `shipping_informations`.* FROM `shipping_informations` WHERE `shipping_informations`.`user_id` = 1 LIMIT 1