app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`birthday`, `comments`, `created_at`, `email`, `heliskiing`, `name`, `password_hash`, `pickle`, `planet`, `spam`, `updated_at`, `walnut`) VALUES ('2011-11-11', 'ssssssssssssssss', '2013-12-14 09:38:20', 'aaaaaaaa', 0, 'aaas', '$2a$10$WBGqHV89F.y3tVqKtfP7YO5fZb1fiCnuuoYHA4gKFqkMwjFkaq2IO', NULL, 'earth', 0, '2013-12-14 09:38:20', NULL)

  def order
    begin
      @billing_information = current_user.billing_information
      if @billing_information.present?
        @billing_information.update_attributes(params[:billing_information])
      else
        current_user.create_billing_information(params[:billing_information])
      end
      @shipping_information = current_user.shipping_information
      if @shipping_information.present?
        @shipping_information.update_attributes(params[:shipping_information])
      else
        current_user.create_shipping_information(params[:shipping_information])
---
SELECT `billing_informations`.* FROM `billing_informations` WHERE `billing_informations`.`user_id` = 1 LIMIT 1
UPDATE `billing_informations` SET `name` = '你好中国', `address` = 'china', `city` = '上海', `state` = '上海', `postal_code` = '1234', `payment_method` = 'visa', `card_number` = '123456', `expiration_date` = '2015', `country` = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\n\'0\': !ruby/hash:ActiveSupport::HashWithIndifferentAccess\n country: cn\n', `updated_at` = '2013-12-16 16:17:20' WHERE `billing_informations`.`id` = 1
INSERT INTO `billing_informations` (`address`, `card_number`, `city`, `country`, `created_at`, `expiration_date`, `name`, `payment_method`, `postal_code`, `same_as_shipping_information`, `state`, `updated_at`, `user_id`) VALUES ('Yangsi Road', '73737377929292', 'Shanghai', '/cn/', '2013-12-14 11:43:15', '11/2015', 'wenbo', 'paypal', '200025', 1, 'Shanghai', '2013-12-14 11:43:15', 1)
SELECT `shipping_informations`.* FROM `shipping_informations` WHERE `shipping_informations`.`user_id` = 1 LIMIT 1
UPDATE `shipping_informations` SET `name` = '文波', `address` = '河南', `city` = '河南', `state` = '郑州', `postal_code` = '1234', `country` = '/us/', `updated_at` = '2013-12-16 16:17:20' WHERE `shipping_informations`.`id` = 1
INSERT INTO `shipping_informations` (`address`, `city`, `country`, `created_at`, `name`, `postal_code`, `state`, `updated_at`, `user_id`) VALUES ('Yangsi Road', 'Shanghai', '/cn/', '2013-12-14 11:43:16', 'wenbo', '200025', 'Shanghai', '2013-12-14 11:43:16', 1)